# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [2]:
# Libraries
import pandas as pd
import numpy as np

# Challenge 1 - Index Functions

In this challenge, we will practice the advanced functions introduced in the lesson. However, before we start, we will load and evaluate our dataset. 

Load the dataset from Ironhack's database:
* db: `admissions predict`
* table: `admissions predict`

In [36]:
# your code here
df1 = pd.read_csv('../../../../dataptmad1121_lessons/module-2/datasets/Admission_Predict.csv')
df1.head()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 27.2 KB

In [37]:
df1.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

Remove trailing spaces at the end of the column names if there are any.

In [111]:
# your code here
#He probado con el método strip, pero solo admite valores de string, si tuviera espacios no los identificaría como 
#números enteros o decimales
df1.columns = df1.columns.str.rstrip()
df1

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82
381,382,325,107,3,3.0,3.5,9.11,1,0.84
382,383,330,116,4,5.0,4.5,9.45,1,0.91
383,384,312,103,3,3.5,4.0,8.78,0,0.67
384,385,333,117,4,5.0,4.0,9.66,1,0.95

Let's evaluate the dataset by looking at the `head` function.

In [112]:
# your code here
df1.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [113]:
# your code here
df1.info() #Como se puede ver no hay valores nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 27.2 KB

Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [114]:
# your code here
pt = df1.pivot_table(index = ["Serial No."])
pt

,CGPA,Chance of Admit,GRE Score,LOR,Research,SOP,TOEFL Score,University Rating
Serial No.,,,,,,,,
1,9.65,0.92,337,4.5,1,4.5,118,4
2,8.00,0.72,316,3.5,1,3.0,104,3
3,8.67,0.80,322,2.5,1,3.5,110,3
4,8.21,0.65,314,3.0,0,2.0,103,2
5,9.34,0.90,330,3.0,1,4.5,115,5
...,...,...,...,...,...,...,...,...
381,9.04,0.82,324,3.5,1,3.5,110,3
382,9.11,0.84,325,3.5,1,3.0,107,3
383,9.45,0.91,330,4.5,1,5.0,116,4
384,8.78,0.67,312,4.0,0,3.5,103,3
385,9.66,0.95,333,4.0,1,5.0,117,4

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [115]:
# your code here
print(pt["GRE Score"].nunique()) #Se ve que no tienen 385 valores únicos por lo que no identifican los datos de forma única
print(pt["CGPA"].nunique())

49
168

Replace the index with an index comprised of two columns - `GRE Score` and `CGPA`. Remove the columns from the dataset as well. Make sure to use `inplace=True`.

In [116]:
PT2 = pt.pivot_table(index=["Serial No."],
               columns=["CGPA", "GRE Score"])
PT2

           Chance of Admit                                              ...  \
CGPA                  6.80 7.20 7.25 7.28 7.30 7.34     7.36 7.40 7.43  ...
GRE Score              300  295  302  296  310  295 299  294  316  297  ...
Serial No.                                                              ...
1                      NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
2                      NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
3                      NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
4                      NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
5                      NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
...                    ...  ...  ...  ...  ...  ...  ..  ...  ...  ...  ...
381                    NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
382                    NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
383                    NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
384                    NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...
385                    NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  ...

           University Rating
CGPA                    9.76     9.78 9.80         9.82 9.87 9.91 9.92
GRE Score                336 339  333  331 336 339  335  334  340  340
Serial No.
1                        NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
2                        NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
3                        NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
4                        NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
5                        NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
...                      ...  ..  ...  ...  ..  ..  ...  ...  ...  ...
381                      NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
382                      NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
383                      NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
384                      NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN
385                      NaN NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN

[385 rows x 2310 columns]

Now change the index back to a sequence starting at zero using the `reset_index` function. Make sure to use `inplace=True`.

In [117]:
# your code here
pt.reset_index(inplace = True)
pt.head()

,Serial No.,CGPA,Chance of Admit,GRE Score,LOR,Research,SOP,TOEFL Score,University Rating
0,1,9.65,0.92,337,4.5,1,4.5,118,4
1,2,8.00,0.72,316,3.5,1,3.0,104,3
2,3,8.67,0.80,322,2.5,1,3.5,110,3
3,4,8.21,0.65,314,3.0,0,2.0,103,2
4,5,9.34,0.90,330,3.0,1,4.5,115,5

# Challenge 2 - Advanced Functions

In this part of the lab, we would like to test complex conditions on the entire dataset at once. Let's start by finding the number of rows where the CGPA is higher than 9 and the student has conducted research.

In [118]:
# your code here
df = pt.eval("CGPA > 9")
df.value_counts() #Sabemos que hay 110 filas con un valor de CGPA mayor que 9

False    275
True     110
dtype: int64

In [119]:
pt.query("CGPA > 9 & Research == 1") #Lo que me ha costado llegar aquí.....101 filas cumplen las dos condiciones

,Serial No.,CGPA,Chance of Admit,GRE Score,LOR,Research,SOP,TOEFL Score,University Rating
0,1,9.65,0.92,337,4.5,1,4.5,118,4
4,5,9.34,0.90,330,3.0,1,4.5,115,5
10,11,9.10,0.78,328,4.5,1,4.0,112,4
19,20,9.50,0.94,328,5.0,1,5.0,116,5
20,21,9.70,0.95,334,4.5,1,5.0,119,5
...,...,...,...,...,...,...,...,...,...
379,380,9.23,0.89,329,4.0,1,4.5,111,4
380,381,9.04,0.82,324,3.5,1,3.5,110,3
381,382,9.11,0.84,325,3.5,1,3.0,107,3
382,383,9.45,0.91,330,4.5,1,5.0,116,4
384,385,9.66,0.95,333,4.0,1,5.0,117,4

Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [120]:
# your code here
df_sop = pt.query("CGPA > 9 & SOP < 3.5")
df_sop #El mean chance of admit se ve en dicha columna

,Serial No.,CGPA,Chance of Admit,GRE Score,LOR,Research,SOP,TOEFL Score,University Rating
28,29,9.40,0.91,338,4.5,1,3.0,118,4
62,63,9.02,0.61,327,3.0,0,3.0,114,3
140,141,9.11,0.83,326,3.0,1,3.0,114,3
217,218,9.01,0.82,324,3.0,1,3.0,111,4
381,382,9.11,0.84,325,3.5,1,3.0,107,3

In [122]:
mean_df = df_sop["Chance of Admit"].mean() #Aquí me he dado cuenta de que tenía un espacio en blanco...
mean_df

0.8019999999999999

We would like to create a deciding factor column for each student. We standardize several columns and then pick the most important factor from a lookup table. If the standardized value is above 0.8, the student will be accepted.

We will start by creating a standardized column for `CGPA`, `GRE Score` and `LOR`. We will name these columns `CGPA_std`, `GRE_std`, and `LOR_std` respecively.

Recall that standardizing a column is done by subtracting the mean of the column from all observations in the column and then dividing each observation in the column by the column's standard deviation.

In the cell below, write a standardization function (a function that takes a column as input and returns a standardized column as output). Make sure to use the `numpy` versions of mean and standard deviation.

In [127]:
def standardize(col):
    """
    This function takes a column from a dataframe 
    and returns a standardized column by subtracting the column's mean
    and dividing by the column's standard deviation.
    """
    
    # your code here

None

Now create the standardized columns `CGPA_std`, `GRE_std`, and `LOR_std` and add them to the `admissions` dataframe.

In [ ]:
# your code here

We will generate the decision choice at random using the code below. Please run the cell.

In [ ]:
# Libraries
from random import choices

In [ ]:
std_columns = ['CGPA_std', 'GRE_std', 'LOR_std']

decision_choice = choices(std_columns, k=admissions.shape[0])

Now create the deciding column using the `lookup` function. The lookup column is `decision_choice` found above. Call the column resulting from the lookup function `deciding_column` and add it to the `admissions` dataframe.

In [ ]:
# your code here

Create a column called `decision` in the `admissions` dataframe. Assign 1 to this column if the value of `deciding_column` is greater than 0.8 and 0 otherwise.

In [ ]:
# your code here

How many applicants will be accepted to the program using the decision column? Compute the result below.

In [ ]:
# your code here

# Challenge 3 - Method Chaining

To increase our coding efficiency, let's make a number of changes to our dataframe in one line of code.

In the cell below, remove all non character symbols from the column names, replace all spaces in column names to underscores, and change all upper case characters to lower case. Assign these new column values to `admissions.columns`.

In [ ]:
# your code here

In the cell below, give all student with a university rating of 4 or higher a 10 point boost on their GRE score and split the column into 4 bins using the `cut` function. Assign this new score to the variable `adjusted_gre`.

In [ ]:
# your code here